app/Controllers/Admin/CGroups.php

    public function index($menuAktip = '', $moduleAktip = '')
    {
        helper('text');

        $menu = new MMenu();
        $datamenu = $menu->listing();
        $model = new MGroups();
        $datamenu2 = $model->findAll();
---
SELECT *
FROM `auth_groups`