app/Controllers/Admin/CMenu.php

    public function rubah($menuAktip = '', $moduleAktip = '')
    {

        $menumodel = new MDataMenu();
        $datamenu = $menumodel->find($this->request->getPost('id_menu'));
        unset($datamenu->id_module);
        unset($datamenu->path);
        unset($datamenu->menu);
        unset($datamenu->icon);

        if (!isset($datamenu->id_module)) {
            $datamenu->id_module = $this->request->getPost('id_module');
            $datamenu->path    = $this->request->getPost('path');
            $datamenu->menu    = $this->request->getPost('menu');
            $datamenu->icon    = $this->request->getPost('icon');
        }
        $menumodel->save($datamenu);
---
UPDATE `tbl_menu` SET `id_module` = '1', `path` = 'groupsusers/index', `menu` = 'auth_groups_users', `icon` = 'fa fa-file-export'
WHERE `tbl_menu`.`id_menu` IN ('7')