app/Controllers/Admin/CModule.php

SELECT *
FROM `tbl_module`
---
    public function index($menuAktip = '', $moduleAktip = '')
    {
        helper('text');

        $menu = new MMenu();
        $datamenu = $menu->listing();
        $model = new MModule();
        $datamodule = $model->findAll();

UPDATE `tbl_module` SET `nama_module` = 'Admin', `icon` = 'fa fa-lock'
WHERE `tbl_module`.`id_module` IN ('1')
---
    public function rubah()
    {

        $modulemodel = new MModule();
        $module = $modulemodel->find($this->request->getPost('id_module'));
        unset($module->nama_module);
        unset($module->icon);

        if (!isset($module->nama_module)) {
            $module->nama_module = $this->request->getPost('nama_module');
            $module->icon    = $this->request->getPost('icon');
        }
        $modulemodel->save($module);